In [11]:
import numpy as np
import pandas as pd

In [12]:
date=pd.read_csv('orders.csv')
time=pd.read_csv('messages.csv')

In [13]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [14]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [15]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [19]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [23]:
date['date']=pd.to_datetime(date['date'])

In [25]:
date.dtypes

date          datetime64[ns]
product_id             int64
city_id                int64
orders                 int64
dtype: object

In [26]:
date['date_year']=date['date'].dt.year
date.sample(3)

          date  product_id  city_id  orders  date_year
578 2019-06-28        5922       25       2       2019
300 2019-05-31        2981       26    1004       2019
977 2018-12-14         460       18       4       2018

In [27]:
date['date_mon']=date['date'].dt.month
date.sample(3)

          date  product_id  city_id  orders  date_year  date_mon
530 2018-08-22        6007       27       1       2018         8
126 2019-07-20        1944       11      16       2019         7
705 2018-10-21        7099       26       4       2018        10

In [28]:
date['date_mon_name']=date['date'].dt.month_name()
date.sample(3)

          date  product_id  city_id  orders  date_year  date_mon date_mon_name
305 2019-07-05          25       18       1       2019         7          July
876 2019-11-05        5848       13       2       2019        11      November
358 2019-01-19        6295        3      44       2019         1       January

In [29]:
date['date_day']=date['date'].dt.day
date.sample(3)

,date,product_id,city_id,orders,date_year,date_mon,date_mon_name,date_day
258,2019-11-04,1775,25,1,2019,11,November,4
598,2018-09-07,1134,13,19,2018,9,September,7
708,2019-06-05,5004,25,5,2019,6,June,5

In [30]:
date['date_week']=date['date'].dt.dayofweek
date.sample(3)

,date,product_id,city_id,orders,date_year,date_mon,date_mon_name,date_day,date_week
374,2018-12-16,4595,13,1,2018,12,December,16,6
590,2018-08-14,3197,17,27,2018,8,August,14,1
180,2019-07-13,4180,16,5,2019,7,July,13,5

In [31]:
date['date_day_name']=date['date'].dt.day_name()
date.sample(3)

,date,product_id,city_id,orders,date_year,date_mon,date_mon_name,date_day,date_week,date_day_name
805,2019-11-28,6339,26,7,2019,11,November,28,3,Thursday
598,2018-09-07,1134,13,19,2018,9,September,7,4,Friday
570,2018-12-18,2687,25,31,2018,12,December,18,1,Tuesday

In [32]:
date['is_weekend']=np.where(date['date_day_name'].isin(['Sunday','Saturday']),1,0)
date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_mon,date_mon_name,date_day,date_week,date_day_name,is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [34]:
time['date']=pd.to_datetime(time['date'])

In [36]:
time.sample(2)

                  date                                                msg
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
19 2014-03-17 23:16:00  МЗ9ПОЗНАК.СО СТРОЙНОЙ ДЕВ.С ДНЕПРА ДО З0 ДЛЯ С...

In [37]:
time.dtypes

date    datetime64[ns]
msg             object
dtype: object

In [38]:
time['hour']=time['date'].dt.hour
time['min']=time['date'].dt.minute
time['sec']=time['date'].dt.second

In [39]:
time.sample(2)

,date,msg,hour,min,sec
282,2012-09-07 01:04:00,девушки кому щас делать нечего пишите.063 94...,1,4,0
183,2013-10-01 01:43:00,Укротители есть? а то я распоясалась жду номерок),1,43,0

In [40]:
time['time']=time['date'].dt.time

In [42]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00